alert("Привет, я бот!");
let n = "";
let rand = 1;
let phrases = [
  "Наш менеджер перезвонит Вам в ближайшее время!",
  "Уточнить детали можно по телефону 123456789",
  "Оставайтесь на связи!",
  "Сегодня прекрасная погода!",
  "С Вами очень приятно общаться!",
  "Хэй",
  "Спасибо",
  "Error404",
  "Hello? world!",
];
while (n != "Пока") {
  n = prompt(
    "Напишите что-то боту, Если хотите закончить беседу, то напишите 'Пока'"
  );
  if (n == "Привет") alert("Привет)");
  else if (n == "Ты кто?") alert("Я бот и моё имя Пятница");
  else if (n == "Как дела?") alert("Хорошо, а у Вас?");
  else if (n != "Пока") {
    rand = Math.floor(Math.random() * phrases.length);
    alert(phrases[rand]);
  }
}
alert("До свидания, рад был пообщаться!");
